### DataFrame

In [1]:
import sys
import pandas as pd
import numpy as np
print(sys.version)
print(pd.__version__)

3.6.3 |Anaconda custom (64-bit)| (default, Oct 15 2017, 03:27:45) [MSC v.1900 64 bit (AMD64)]
0.20.3

In [2]:
N1 = pd.Series({'C_Name':'India',
                'C_Sport':'Hockey',
                'C_Bird' :'Peacock'})                   
N2 = pd.Series({'C_Name':'USA',
                'C_Sport':'Baseball',
                'C_Bird' :'Bald Eagle'})                   
N3 = pd.Series({'C_Name':'England',
                'C_Sport':'Cricket',
                'C_Bird' :'Robin'})                   

df = pd.DataFrame([N1,N2,N3], index = ['GRP_A','GRP_B','GRP_C'])
df.head()

           C_Bird   C_Name   C_Sport
GRP_A     Peacock    India    Hockey
GRP_B  Bald Eagle      USA  Baseball
GRP_C       Robin  England   Cricket

In [40]:
df.iloc[:,1:len(df.columns)]

        C_Name   C_Sport
GRP_A    India    Hockey
GRP_B      USA  Baseball
GRP_C  England   Cricket

In [16]:
df1 = df.drop('GRP_C')
df1

           C_Bird C_Name   C_Sport
GRP_A     Peacock  India    Hockey
GRP_B  Bald Eagle    USA  Baseball

###practice - copy, del

In [18]:
df.describe()

            C_Bird C_Name  C_Sport
count            3      3        3
unique           3      3        3
top     Bald Eagle  India  Cricket
freq             1      1        1

In [81]:
df1 = pd.DataFrame([{'C_Name':'Sagar','State':'Odisha'},
                    {'C_Name':'Naveen','State':'AP'},
                    {'C_Name':'AB','State':'Telangana'}])                   
df1 = df1.set_index('C_Name')
df2 = pd.DataFrame([{'C_Name':'Jay','State':'Stanford'},
                    {'C_Name':'Puneet','State':'Alpharetta'},
                    {'C_Name':'Manoj','State':'California'}])                    
df2 = df2.set_index('C_Name')

In [82]:
pd.merge(df1,df2,how='outer',left_index=True,right_index=True)

          State_x     State_y
C_Name
AB      Telangana         NaN
Jay           NaN    Stanford
Manoj         NaN  California
Naveen         AP         NaN
Puneet        NaN  Alpharetta
Sagar      Odisha         NaN

In [83]:
pd.merge(df1,df2,how='inner',left_index=True,right_index=True)

Empty DataFrame
Columns: [State_x, State_y]
Index: []

In [19]:
import string
lcase= string.ascii_lowercase
ucase= string.ascii_uppercase
lcase = list(lcase)
ucase = list(ucase)
print(lcase)
print(ucase)

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z']
['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']

In [20]:
letters = pd.DataFrame([lcase, ucase, list(range(26))])
letters

  0  1  2  3  4  5  6  7  8  9  ...  16  17  18  19  20  21  22  23  24  25
0  a  b  c  d  e  f  g  h  i  j ...   q   r   s   t   u   v   w   x   y   z
1  A  B  C  D  E  F  G  H  I  J ...   Q   R   S   T   U   V   W   X   Y   Z
2  0  1  2  3  4  5  6  7  8  9 ...  16  17  18  19  20  21  22  23  24  25

[3 rows x 26 columns]